# MechanicalEquipmentSetOnStandby Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MechanicalEquipmentSetOnStandby Property
ParameterTypeId Class See Also
---
"On Standby"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MechanicalEquipmentSetOnStandby { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MechanicalEquipmentSetOnStandby As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MechanicalEquipmentSetOnStandby {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace